app/controllers/admin/dashboard_controller.rb

  def show
    @product_count = Product.count
    @category_count = Category.count
---
SELECT COUNT(*) FROM "products"
SELECT COUNT(*) FROM "categories"