app/views/orders/show.html.erb

        <% total = 0 %>
        <% @order.line_items.each do |item| %>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."order_id" = $1  [["order_id", 16]]