app/controllers/application_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" IN ($1, $2)  [["id", 8], ["id", 11]]
---
  def enhanced_cart
    @enhanced_cart ||= Product.where(id: cart.keys).map {|product| { product:product, quantity: cart[product.id.to_s] } }